import React from "react";
import ServicesPages from "@/app/_components/ServicesPages/ServicesPages";
import imgSection from "../../../assets/images/شحن مكه.jpg";

export const metadata = {
  title: "نقل الأثاث في مكة - شركة الصابرين",
  description:
    "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج مكة بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
  keywords: [
    "نقل الأثاث في مكة",
    "شحن الأثاث في مكة",
    "نقل العفش داخل مكة",
    "نقل الشركات والمكاتب في مكة",
    "تخزين الأثاث في مكة",
    "فك وتركيب الأثاث في مكة",
    "خدمات التعبئة والتغليف في مكة",
  ],
  openGraph: {
    title: "نقل الأثاث في مكة - شركة الصابرين",
    description:
      "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج مكة بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
    url: "https://al-sabreentransport.com/services/makkah",
    images: [
      {
        url: "../../../assets/images/شحن مكه.jpg",
        width: 1200,
        height: 630,
        alt: "نقل الأثاث في مكة",
      },
    ],
    type: "website",
  },
};

const serviceSections = [
  {
    title: "نقل الأثاث داخل مكة",
    description:
      "توفر شركة الصابرين خدمات نقل الأثاث داخل مكة بأعلى معايير الجودة. نضمن لك تجربة نقل سلسة وآمنة مع استخدام أحدث وسائل التغليف والحماية.",
    link: "/services/makkah",
  },
  {
    title: "نقل الأثاث خارج مكة",
    description:
      "نقدم خدمات نقل العفش خارج مكة إلى جميع المدن السعودية، مع توفير سيارات مجهزة لحماية الأثاث أثناء النقل لمسافات طويلة.",
    link: "/services",
  },
  {
    title: "نقل الشركات والمكاتب",
    description:
      "نساعدك في نقل مكتبك أو شركتك بأمان وسرعة، مع ترتيب الأثاث في المكان الجديد لضمان استمرارية العمل دون تأخير.",
    link: "/services",
  },
  {
    title: "التخزين المؤقت للأثاث",
    description:
      "نوفر مستودعات آمنة لتخزين العفش لفترات مؤقتة مع أنظمة حماية متقدمة.",
    link: "/services",
  },
  {
    title: "خدمات الفك والتركيب",
    description:
      "نوفر فريقًا متخصصًا لفك وتركيب الأثاث بأفضل الطرق، مما يضمن الحفاظ على سلامته أثناء النقل.",
    link: "/",
  },
  {
    title: "شحن الأثاث دوليًا",
    description:
      "نقدم خدمات شحن الأثاث إلى خارج السعودية، سواءً عبر النقل الجوي أو البحري، مع توفير الحماية والتغليف المناسب.",
    link: "/services",
  },
  {
    title: "تنظيف الأثاث بعد النقل",
    description:
      "نقدم خدمات تنظيف وتعقيم الأثاث بعد نقله لضمان بيئة نظيفة وصحية.",
    link: "/services",
  },
  {
    title: "خدمات التعبئة والتغليف",
    description:
      "نقدم حلول تغليف احترافية للحفاظ على الأثاث أثناء النقل، باستخدام مواد ذات جودة عالية.",
    link: "/",
  },
];

export default function Makkah() {
  return (
    <div>
      <ServicesPages
        ImgSection={imgSection}
        city="مكة"
        serviceSections={serviceSections}
      />
    </div>
  );
}
