import ServicesPages from "@/app/_components/ServicesPages/ServicesPages";
import React from "react";
import imgSection from "../../../assets/images/شحن حفر الباطن.jpg";

export const metadata = {
  title: "نقل الأثاث في حفر الباطن - شركة الصابرين",
  description:
    "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج حفر الباطن بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
  keywords: [
    "نقل الأثاث في حفر الباطن",
    "شحن الأثاث في حفر الباطن",
    "نقل العفش داخل حفر الباطن",
    "نقل الشركات والمكاتب في حفر الباطن",
    "تخزين الأثاث في حفر الباطن",
    "فك وتركيب الأثاث في حفر الباطن",
    "خدمات التعبئة والتغليف في حفر الباطن",
  ],
  openGraph: {
    title: "نقل الأثاث في حفر الباطن - شركة الصابرين",
    description:
      "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج حفر الباطن بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
    url: "https://al-sabreentransport.com/services/hafar-al-batin",
    images: [
      {
        url: "../../../assets/images/شحن حفر الباطن.jpg",
        width: 1200,
        height: 630,
        alt: "نقل الأثاث في حفر الباطن",
      },
    ],
    type: "website",
  },
};

const serviceSections = [
  {
    title: "نقل الأثاث داخل حفر الباطن",
    description:
      "توفر شركة الصابرين خدمات نقل الأثاث داخل حفر الباطن بأعلى معايير الجودة. نضمن لك تجربة نقل سلسة وآمنة مع استخدام أحدث وسائل التغليف والحماية.",
    link: "/services/hafar-al-batin",
  },
  {
    title: "نقل الأثاث خارج حفر الباطن",
    description:
      "نقدم خدمات نقل العفش خارج حفر الباطن إلى جميع المدن السعودية، مع توفير سيارات مجهزة لحماية الأثاث أثناء النقل لمسافات طويلة.",
    link: "/services",
  },
  {
    title: "نقل الشركات والمكاتب",
    description:
      "نساعدك في نقل مكتبك أو شركتك بأمان وسرعة، مع ترتيب الأثاث في المكان الجديد لضمان استمرارية العمل دون تأخير.",
    link: "/services",
  },
  {
    title: "التخزين المؤقت للأثاث",
    description:
      "نوفر مستودعات آمنة لتخزين العفش لفترات مؤقتة مع أنظمة حماية متقدمة.",
    link: "/services",
  },
  {
    title: "خدمات الفك والتركيب",
    description:
      "نوفر فريقًا متخصصًا لفك وتركيب الأثاث بأفضل الطرق، مما يضمن الحفاظ على سلامته أثناء النقل.",
    link: "/",
  },
  {
    title: "شحن الأثاث دوليًا",
    description:
      "نقدم خدمات شحن الأثاث إلى خارج السعودية، سواءً عبر النقل الجوي أو البحري، مع توفير الحماية والتغليف المناسب.",
    link: "/services",
  },
  {
    title: "تنظيف الأثاث بعد النقل",
    description:
      "نقدم خدمات تنظيف وتعقيم الأثاث بعد نقله لضمان بيئة نظيفة وصحية.",
    link: "/services",
  },
  {
    title: "خدمات التعبئة والتغليف",
    description:
      "نقدم حلول تغليف احترافية للحفاظ على الأثاث أثناء النقل، باستخدام مواد ذات جودة عالية.",
    link: "/",
  },
];

export default function HafarAlBatin() {
  return (
    <div>
      <ServicesPages
        ImgSection={imgSection}
        city="حفر الباطن"
        serviceSections={serviceSections}
      />
    </div>
  );
}
