import React from "react";
import ServicesPages from "@/app/_components/ServicesPages/ServicesPages";
import imgSection from "../../../assets/images/شحن الدمام.jpg";

export const metadata = {
  title: "نقل الأثاث في الدمام - شركة الصابرين",
  description:
    "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج الدمام بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
  keywords: [
    "نقل الأثاث في الدمام",
    "شحن الأثاث في الدمام",
    "نقل العفش داخل الدمام",
    "نقل الشركات والمكاتب في الدمام",
    "تخزين الأثاث في الدمام",
    "فك وتركيب الأثاث في الدمام",
    "خدمات التعبئة والتغليف في الدمام",
  ],
  openGraph: {
    title: "نقل الأثاث في الدمام - شركة الصابرين",
    description:
      "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج الدمام بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
    url: "https://al-sabreentransport.com/services/dammam",
    images: [
      {
        url: "../../../assets/images/شحن الدمام.jpg",
        width: 1200,
        height: 630,
        alt: "نقل الأثاث في الدمام",
      },
    ],
    type: "website",
  },
};

const serviceSections = [
  {
    title: "نقل الأثاث داخل الدمام",
    description:
      "توفر شركة الصابرين خدمات نقل الأثاث داخل الدمام بأعلى معايير الجودة. نضمن لك تجربة نقل سلسة وآمنة مع استخدام أحدث وسائل التغليف والحماية.",
    link: "/services/dammam",
  },
  {
    title: "نقل الأثاث خارج الدمام",
    description:
      "نقدم خدمات نقل العفش خارج الدمام إلى جميع المدن السعودية، مع توفير سيارات مجهزة لحماية الأثاث أثناء النقل لمسافات طويلة.",
    link: "/services",
  },
  {
    title: "نقل الشركات والمكاتب",
    description:
      "نساعدك في نقل مكتبك أو شركتك بأمان وسرعة، مع ترتيب الأثاث في المكان الجديد لضمان استمرارية العمل دون تأخير.",
    link: "/services",
  },
  {
    title: "التخزين المؤقت للأثاث",
    description:
      "نوفر مستودعات آمنة لتخزين العفش لفترات مؤقتة مع أنظمة حماية متقدمة.",
    link: "/services",
  },
  {
    title: "خدمات الفك والتركيب",
    description:
      "نوفر فريقًا متخصصًا لفك وتركيب الأثاث بأفضل الطرق، مما يضمن الحفاظ على سلامته أثناء النقل.",
    link: "/",
  },
  {
    title: "شحن الأثاث دوليًا",
    description:
      "نقدم خدمات شحن الأثاث إلى خارج السعودية، سواءً عبر النقل الجوي أو البحري، مع توفير الحماية والتغليف المناسب.",
    link: "/services",
  },
  {
    title: "تنظيف الأثاث بعد النقل",
    description:
      "نقدم خدمات تنظيف وتعقيم الأثاث بعد نقله لضمان بيئة نظيفة وصحية.",
    link: "/services",
  },
  {
    title: "خدمات التعبئة والتغليف",
    description:
      "نقدم حلول تغليف احترافية للحفاظ على الأثاث أثناء النقل، باستخدام مواد ذات جودة عالية.",
    link: "/",
  },
];

export default function Dammam() {
  return (
    <div>
      <ServicesPages
        ImgSection={imgSection}
        city="الدمام"
        serviceSections={serviceSections}
      />
    </div>
  );
}
