import React from "react";
import ServicesPages from "@/app/_components/ServicesPages/ServicesPages";
import imgSection from "../../../assets/images/شحن القصيم.jpg";

export const metadata = {
  title: "نقل الأثاث في القصيم - شركة الصابرين",
  description:
    "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج القصيم بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
  keywords: [
    "نقل الأثاث في القصيم",
    "شحن الأثاث في القصيم",
    "نقل العفش داخل القصيم",
    "نقل الشركات والمكاتب في القصيم",
    "تخزين الأثاث في القصيم",
    "فك وتركيب الأثاث في القصيم",
    "خدمات التعبئة والتغليف في القصيم",
  ],
  openGraph: {
    title: "نقل الأثاث في القصيم - شركة الصابرين",
    description:
      "شركة الصابرين تقدم خدمات نقل الأثاث داخل وخارج القصيم بأعلى معايير الجودة، مع توفير حلول شحن، تخزين، وتغليف متميزة.",
    url: "https://al-sabreentransport.com/services/qassim",
    images: [
      {
        url: "../../../assets/images/شحن القصيم.jpg",
        width: 1200,
        height: 630,
        alt: "نقل الأثاث في القصيم",
      },
    ],
    type: "website",
  },
};

const serviceSections = [
  {
    title: "نقل الأثاث داخل القصيم",
    description:
      "توفر شركة الصابرين خدمات نقل الأثاث داخل القصيم بأعلى معايير الجودة. نضمن لك تجربة نقل سلسة وآمنة مع استخدام أحدث وسائل التغليف والحماية.",
    link: "/services/qassim",
  },
  {
    title: "نقل الأثاث خارج القصيم",
    description:
      "نقدم خدمات نقل العفش خارج القصيم إلى جميع المدن السعودية، مع توفير سيارات مجهزة لحماية الأثاث أثناء النقل لمسافات طويلة.",
    link: "/services",
  },
  {
    title: "نقل الشركات والمكاتب",
    description:
      "نساعدك في نقل مكتبك أو شركتك بأمان وسرعة، مع ترتيب الأثاث في المكان الجديد لضمان استمرارية العمل دون تأخير.",
    link: "/services",
  },
  {
    title: "التخزين المؤقت للأثاث",
    description:
      "نوفر مستودعات آمنة لتخزين العفش لفترات مؤقتة مع أنظمة حماية متقدمة.",
    link: "/services",
  },
  {
    title: "خدمات الفك والتركيب",
    description:
      "نوفر فريقًا متخصصًا لفك وتركيب الأثاث بأفضل الطرق، مما يضمن الحفاظ على سلامته أثناء النقل.",
    link: "/",
  },
  {
    title: "شحن الأثاث دوليًا",
    description:
      "نقدم خدمات شحن الأثاث إلى خارج السعودية، سواءً عبر النقل الجوي أو البحري، مع توفير الحماية والتغليف المناسب.",
    link: "/services",
  },
  {
    title: "تنظيف الأثاث بعد النقل",
    description:
      "نقدم خدمات تنظيف وتعقيم الأثاث بعد نقله لضمان بيئة نظيفة وصحية.",
    link: "/services",
  },
  {
    title: "خدمات التعبئة والتغليف",
    description:
      "نقدم حلول تغليف احترافية للحفاظ على الأثاث أثناء النقل، باستخدام مواد ذات جودة عالية.",
    link: "/",
  },
];

export default function Qassim() {
  return (
    <div>
      <ServicesPages
        ImgSection={imgSection}
        city="القصيم"
        serviceSections={serviceSections}
      />
    </div>
  );
}
